app/controllers/cart_items_controller.rb

SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = $1  [["cart_id", 1]]
---
    def show
       cartItem = CartItem.find(params[:id])

INSERT INTO "cart_items" ("cart_id", "item_id", "quantity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cart_id", 1], ["item_id", 2], ["quantity", 1], ["created_at", "2023-02-25 11:45:37.107796"], ["updated_at", "2023-02-25 11:45:37.107796"]]
---
    def create
       cartItem = current_user.cart.cart_items << CartItem.new(cart_item_params)

DELETE FROM "cart_items" WHERE "cart_items"."id" = $1  [["id", 19]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = $1 AND "cart_items"."item_id" = $2  [["cart_id", 1], ["item_id", 1]]
INSERT INTO "cart_items" ("cart_id", "item_id", "quantity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cart_id", 1], ["item_id", 1], ["quantity", 7], ["created_at", "2023-02-25 15:48:22.569964"], ["updated_at", "2023-02-25 15:48:22.569964"]]
---
    def update
      puts "update"
      cart = current_user.cart
      cart.cart_items.where(item_id: params[:item_id]).destroy_all
      cart.cart_items << CartItem.new(
         item_id: params[:item_id],
         quantity: params[:quantity],

      )

SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = $1  [["id", 47]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = $1 AND "cart_items"."item_id" = $2  [["cart_id", 1], ["item_id", 1]]
SELECT "items".* FROM "items" INNER JOIN "cart_items" ON "items"."id" = "cart_items"."item_id" WHERE "cart_items"."cart_id" = $1  [["cart_id", 1]]
---
    def destroy
      cartItem = CartItem.find(params[:id])
      cart = cartItem.cart
      cart.cart_items.where(item_id: cartItem.item_id).destroy_all