app/controllers/carts_controller.rb

    def index
       render json: Cart.all.to_json()
---
SELECT "carts".* FROM "carts"

    def destroy
       cart = Cart.find(params[:id])
       cart.cart_items.destroy_all
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = $1  [["id", 26]]
DELETE FROM "carts" WHERE "carts"."id" = $1  [["id", 1]]