app/controllers/items_controller.rb

SELECT "items".* FROM "items"
---
    def index
       render json: Item.all.to_json()

SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
    def show
       item = Item.find(params[:id])