app/controllers/users_controller.rb

SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users"
---
    def index
        render json: User.all.to_json(include: :cart)